Merge branch 'master' of https://github.com/henry-luo/lambda
